title: Standard - Shell Socket Redirection
id: de305d54-75b4-431b-adb2-eb6b9e546014
status: experimental
logsource:
    product: linux
    category: honeypot
    service: cowrie
detection:
    selection_socket:
        - input|re: 'exec\s+\d+<>/dev/tcp/\S+'
        - input|re: '\/dev\/tcp\/'
        - input|re: 'nohup\s+bash\s+-c\s+"exec\s+\d+<>/dev/tcp/\S+"'
    selection_flow:
        - input|re: 'echo\s+-n\s+".*"\s*&>\d+'
        - input|re: 'cat\s+0<&\d+\s*>\s*\/tmp\/\S+'
    # require both socket creation and evidence of data transfer / file write
    condition: selection_socket and selection_flow
level: high  # 일반적인 환경에서 /dev/tcp 사용은 매우 드물기에 위험도를 높임