title: Standard - Common Linux Download Tools
id: 5f9e2b34-8c9a-4e12-b567-f0123456789a
logsource:
    product: linux
    category: honeypot
    service: cowrie
detection:
    selection_download:
        - input|re: '\bwget\s+https?://'
        - input|re: '\bcurl\s+(-sS|--silent|-o|-O|https?://)'
        - input|re: '\btftp\s+(-g|-l|\s)'
        - input|re: '\bftpget\b'
        - input|re: '\bbusybox\s+(wget|curl|tftp|ftpget)\b'
    condition: selection_download