title: Standard - Competing Miner Process Search
id: f47ac10b-58cc-4372-a567-0e02b2c3d479
status: experimental
logsource:
  product: linux
  category: honeypot
  service: cowrie
detection:
  selection:
    input|contains|all:
      - 'ps'
      - 'miner'
  condition: selection
level: medium