title: Potential Cryptominer Reconnaissance Events
id: f47ac10b-58cc-4372-a567-0e02b2c3d47a
status: experimental
description: |
  Detects individual commands often used by cryptominer actors for system reconnaissance, 
  including CPU info checks, network discovery, and searching for competing miners.
author: BISHOP1027
date: 2026-02-16
references:
  - internal-honeypot-telemetry
logsource:
  product: linux
  category: honeypot
  service: cowrie
detection:
  selection_cpu:
    input|contains: '/proc/cpuinfo'
  selection_network:
    input|contains: 'ifconfig'
  selection_miner_check:
    input|contains|all:
      - 'ps'
      - 'miner'
  selection_specific_discovery:
    input|contains: 
      - 'locate D877F783D5D3EF8Cs'
      - '/ip cloud print'
  selection_sanity_check:
    input|contains: 'echo Hi | cat -n'
  condition: 1 of selection_*
level: medium
tags:
  - attack.t1082
  - attack.t1016
  - attack.t1057